nxp-mcuxpresso/mcux-soc-svd/MCXA457/MCXA457.xml
        <register>
          <name>AIPS_BRIDGE_GROUP1_MEM_RULE1</name>
          <description>AIPS Bridge Group 1 Memory Rule 1</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33333333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPI_FILETER0</name>
              <description>SPI_FILETER0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T1S0</name>
              <description>10BASE_T1S0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB1</name>
              <description>USB1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB1_PHY</name>
              <description>USB1_PHY</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_SECURE_CTRL_MEM_RULE0</name>
          <description>AHB Secure Control Peripheral Rule</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RULE0</name>
              <description>AHBSC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RULE1</name>
              <description>AHBSC ALIAS0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RULE2</name>
              <description>AHBSC ALIAS1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RULE3</name>
              <description>AHBSC ALIAS2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_PERIPHERAL0_MEM_RULE1</name>
          <description>AHB Peripheral 0 Memory Rule 1</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO0</name>
              <description>GPIO0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO0_ALIAS</name>
              <description>GPIO0 ALIAS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_PERIPHERAL0_MEM_RULE2</name>
          <description>AHB Peripheral 0 Memory Rule 2</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO1</name>
              <description>GPIO1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO1_ALIAS</name>
              <description>GPIO1 ALIAS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_PERIPHERAL0_MEM_RULE3</name>
          <description>AHB Peripheral 0 Memory Rule 3</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO2</name>
              <description>GPIO2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO2_ALIAS</name>
              <description>GPIO2 ALIAS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_PERIPHERAL0_MEM_RULE4</name>
          <description>AHB Peripheral 0 Memory Rule 4</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPIO3</name>
              <description>GPIO3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO3_ALIAS</name>
              <description>GPIO3 ALIAS</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
