nxp-mcuxpresso/mcux-soc-svd/MCXA457/MCXA457.xml
        <register>
          <name>GENCS</name>
          <description>TSI General Control and Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAEN_EOS</name>
              <description>In-progress DMA Transfer Request Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAEN_EOS_0</name>
                  <description>Disable DMA request at End of Scan event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAEN_EOS_1</name>
                  <description>Enable DMA request at End of event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN_OUTRG</name>
              <description>Out of Range DMA Transfer Request Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAEN_OUTRG_0</name>
                  <description>Disable DMA request at Out-of-Range event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAEN_OUTRG_1</name>
                  <description>Enable DMA request at Out-of-Range event</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STM</name>
              <description>Scan Trigger Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STM_0</name>
                  <description>Software trigger scan</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STM_1</name>
                  <description>Hardware trigger scan</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSIEN</name>
              <description>Touch Sensing Input Module Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSIEN_0</name>
                  <description>TSI module disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSIEN_1</name>
                  <description>TSI module enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLK_SEL</name>
              <description>KHz clock selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_SEL_0</name>
                  <description>Select 16K clock to use</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_SEL_1</name>
                  <description>Select 32K clock to use</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWTS</name>
              <description>Software Trigger Start</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWTS_0</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWTS_1</name>
                  <description>Takes effect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSIEN_DPD</name>
              <description>Enable of 3v domain logic in this IP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSIEN_DPD_0</name>
                  <description>3v domain logic is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSIEN_DPD_1</name>
                  <description>3v domain logic is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DVOLT</name>
              <description>DVOLT</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DVOLT_0</name>
                  <description>Vm=0.6 V, Vp=1.73 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_1</name>
                  <description>Vm=0.6 V, Vp=1.82 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_2</name>
                  <description>Vm=0.6 V, Vp=1.89 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_3</name>
                  <description>Vm=0.6 V, Vp=1.98 V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_4</name>
                  <description>Vm=0.6 V, Vp=2.06 V</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_5</name>
                  <description>Vm=0.6 V, Vp=2.14 V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_6</name>
                  <description>Vm=0.6 V, Vp=2.23 V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_7</name>
                  <description>Vm=0.6 V, Vp=2.31 V</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_8</name>
                  <description>Vm=0.6 V, Vp=2.39 V</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_9</name>
                  <description>Vm=0.6 V, Vp=2.47 V</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_10</name>
                  <description>Vm=0.6 V, Vp=2.56 V</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_11</name>
                  <description>Vm=0.6 V, Vp=2.64 V</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_12</name>
                  <description>Vm=0.6 V, Vp=2.72 V</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_13</name>
                  <description>Vm=0.6 V, Vp=2.81 V</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_14</name>
                  <description>Vm=0.6 V, Vp=2.88 V</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DVOLT_15</name>
                  <description>Vm=0.6 V, Vp=2.97 V</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEBOUNCE_COUNTER_CONFIGURED</name>
              <description>DEBOUNCE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_0</name>
                  <description>1 out of range event can generate interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_1</name>
                  <description>2 out of range events can generate interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_2</name>
                  <description>3 out of range events can generate interrupt</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_3</name>
                  <description>4 out of range events can generate interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_4</name>
                  <description>5 out of range events can generate interrupt</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_5</name>
                  <description>6 out of range events can generate interrupt</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_6</name>
                  <description>7 out of range events can generate interrupt</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_7</name>
                  <description>8 out of range events can generate interrupt</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_8</name>
                  <description>9 out of range events can generate interrupt</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_9</name>
                  <description>10 out of range events can generate interrupt</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_10</name>
                  <description>11 out of range events can generate interrupt</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_11</name>
                  <description>12 out of range events can generate interrupt</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_12</name>
                  <description>13 out of range events can generate interrupt</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_13</name>
                  <description>14 out of range events can generate interrupt</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_14</name>
                  <description>15 out of range events can generate interrupt</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_15</name>
                  <description>16 out of range events can generate interrupt</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_16</name>
                  <description>17 out of range events can generate interrupt</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_17</name>
                  <description>18 out of range events can generate interrupt</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_18</name>
                  <description>19 out of range events can generate interrupt</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_19</name>
                  <description>20 out of range events can generate interrupt</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_20</name>
                  <description>21 out of range events can generate interrupt</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_21</name>
                  <description>22 out of range events can generate interrupt</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_22</name>
                  <description>23 out of range events can generate interrupt</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_23</name>
                  <description>24 out of range events can generate interrupt</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_24</name>
                  <description>25 out of range events can generate interrupt</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_25</name>
                  <description>26 out of range events can generate interrupt</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_26</name>
                  <description>27 out of range events can generate interrupt</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_27</name>
                  <description>28 out of range events can generate interrupt</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_28</name>
                  <description>29 out of range events can generate interrupt</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_29</name>
                  <description>30 out of range events can generate interrupt</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_30</name>
                  <description>31 out of range events can generate interrupt</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEBOUNCE_COUNTER_CONFIGURED_31</name>
                  <description>32 out of range events can generate interrupt</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESOR</name>
              <description>End of Scan Interrupt enable.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ESOR_0</name>
                  <description>End of Scan interrupt is disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ESOR_1</name>
                  <description>End of Scan interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTRG_EN</name>
              <description>Out-of-range interrupt enable.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTRG_EN_0</name>
                  <description>Out-of-range interrupt is disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTRG_EN_1</name>
                  <description>Out-of-range interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUL</name>
          <description>TSI Mutual-cap Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M_VPRE_CHOOSE</name>
              <description>M_VPRE_CHOOSE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_VPRE_CHOOSE_0</name>
                  <description>Internal 1.2 V voltage (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_VPRE_CHOOSE_1</name>
                  <description>External 1.2 V voltage from PMC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_MODE</name>
              <description>M_MODE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_MODE_0</name>
                  <description>Sense both pos and neg side</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_MODE_1</name>
                  <description>Sense pos side only</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_MODE_2</name>
                  <description>Sense neg side only</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_MODE_3</name>
                  <description>Not allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_TRIM_CAP</name>
              <description>M_TRIM_CAP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_TRIM_CAP_0</name>
                  <description>0 pF (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_TRIM_CAP_1</name>
                  <description>10 pF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_TRIM_CAP_2</name>
                  <description>10 pF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_TRIM_CAP_3</name>
                  <description>20 pF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_TRIM_USED</name>
              <description>Not use, just reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
