nxp-mcuxpresso/mcux-soc-svd/MCXA457/MCXA457.xml
        <register>
          <name>SINC</name>
          <description>TSI SINC Filter Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x70001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSC_CONTROL_OUT</name>
              <description>SSC_CONTROL_OUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSC_CONTROL_OUT_0</name>
                  <description>SSC output value is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSC_CONTROL_OUT_1</name>
                  <description>SSC output value is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINC_VALID</name>
              <description>SINC_VALID</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINC_VALID_0</name>
                  <description>SINC filter is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_VALID_1</name>
                  <description>SINC filter is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINC_OVERFLOW_FLAG</name>
              <description>SINC_OVERFLOW_FLAG</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINC_OVERFLOW_FLAG_0</name>
                  <description>The counter result has no overflow occurrence in the last scan process</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_OVERFLOW_FLAG_1</name>
                  <description>The counter result has an overflow occurrence in the last scan process</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWITCH_ENABLE</name>
              <description>SWITCH_ENABLE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWITCH_ENABLE_0</name>
                  <description>SSC function is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWITCH_ENABLE_1</name>
                  <description>SSC function is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINC_DECIMATION</name>
              <description>SINC_DECIMATION</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINC_DECIMATION_0</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 1 trigger period</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_1</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 2 trigger periods</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_2</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 3 trigger periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_3</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 4 trigger periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_4</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 5 trigger periods</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_5</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 6 trigger periods</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_6</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 7 trigger periods</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_7</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 8 trigger periods</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_8</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 9 trigger periods</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_9</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 10 trigger periods</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_10</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 11 trigger periods</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_11</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 12 trigger periods</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_12</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 13 trigger periods</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_13</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 14 trigger periods</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_14</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 15 trigger periods</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_15</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 16 trigger periods</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_16</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 17 trigger periods</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_17</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 18 trigger periods</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_18</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 19 trigger periods</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_19</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 20 trigger periods</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_20</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 21 trigger periods</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_21</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 22 trigger periods</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_22</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 23 trigger periods</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_23</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 24 trigger periods</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_24</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 25 trigger periods</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_25</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 26 trigger periods</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_26</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 27 trigger periods</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_27</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 28 trigger periods</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_28</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 29 trigger periods</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_29</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 30 trigger periods</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_30</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 31 trigger periods</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_DECIMATION_31</name>
                  <description>The TSI_DATA[TSICNT] bits is the counter value of 32 trigger periods</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINC_ORDER</name>
              <description>SINC_ORDER</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINC_ORDER_0</name>
                  <description>Using 1 order sinc filter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_ORDER_1</name>
                  <description>Using 2 order sinc filter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINC_CUTOFF</name>
              <description>SINC_CUTOFF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINC_CUTOFF_0</name>
                  <description>div=1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_CUTOFF_1</name>
                  <description>div=2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_CUTOFF_2</name>
                  <description>div=4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_CUTOFF_3</name>
                  <description>div=8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_CUTOFF_4</name>
                  <description>div=16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_CUTOFF_5</name>
                  <description>div=32</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_CUTOFF_6</name>
                  <description>div=64</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_CUTOFF_7</name>
                  <description>div=128</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_CUTOFF_8</name>
                  <description>NC</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_CUTOFF_9</name>
                  <description>NC</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_CUTOFF_10</name>
                  <description>NC</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_CUTOFF_11</name>
                  <description>NC</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_CUTOFF_12</name>
                  <description>NC</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_CUTOFF_13</name>
                  <description>NC</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_CUTOFF_14</name>
                  <description>NC</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINC_CUTOFF_15</name>
                  <description>NC</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
